CSS元素.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CSS 元素</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="CSS 元素"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-01 18:03:08 CST"/>
<meta name="author" content="HDC"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">CSS 元素</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 :before 伪元素</a></li>
<li><a href="#sec-2">2 &lt;section&gt; 标签</a></li>
<li><a href="#sec-3">3 &lt;article&gt; 标签</a></li>
<li><a href="#sec-4">4 &lt;header&gt; 标签</a></li>
<li><a href="#sec-5">5 &lt;footer&gt; 标签</a></li>
<li><a href="#sec-6">6 &lt;aside&gt; 标签</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> :before 伪元素</h2>
<div class="outline-text-2" id="text-1">

<p><b>定义和用法</b>
</p>
<p>
:before 伪元素在元素之前添加内容。
这个伪元素允许创作人员在元素内容的最前面插入生成内容。默认地，这个伪元素是行内元素，不过可以使用属性 display 改变这一点。
</p>
<p>
<b>实例</b>
</p>
<p>
此样式会在每个 h1 元素之前播放一段声音：
</p>


<pre class="src src-html">h1:before
{
  content:url(beep.wav);
}
</pre>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> &lt;section&gt; 标签</h2>
<div class="outline-text-2" id="text-2">

<p><b>定义和用法</b>
</p>
<p>
&lt;section&gt; 标签定义文档中的节（section、区段）。比如章节、页眉、页脚或文档中的其他部分。
</p>
<p>
<b>实例</b>
</p>
<p>
文档中的区段，解释了 PRC：
</p>


<pre class="src src-html">&lt;<span style="color: #cae682;">section</span>&gt;
  &lt;<span style="color: #cae682;">h1</span>&gt;<span style="font-weight: bold; text-decoration: underline;">PRC</span>&lt;/<span style="color: #cae682;">h1</span>&gt;
  &lt;<span style="color: #cae682;">p</span>&gt;The People's Republic of China was born in 1949...&lt;/<span style="color: #cae682;">p</span>&gt;
&lt;/<span style="color: #cae682;">section</span>&gt;
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> &lt;article&gt; 标签</h2>
<div class="outline-text-2" id="text-3">

<p><b>定义和用法</b>
</p>
<p>
&lt;article&gt; 标签定义独立的内容。
可能的 article 实例：
</p><ul>
<li>论坛帖子
</li>
<li>报纸文章
</li>
<li>博客条目
</li>
<li>用户评论
</li>
</ul>


<p>
<b>实例</b>
</p>



<pre class="src src-html">&lt;<span style="color: #cae682;">article</span>&gt;
  &lt;<span style="color: #cae682;">a</span> <span style="color: #cae682;">href</span>=<span style="color: #95e454;">"http://www.apple.com"</span>&gt;Safari 5 released&lt;/<span style="color: #cae682;">a</span>&gt;&lt;<span style="color: #cae682;">br</span> /&gt;
  7 Jun 2010, Just after the announcement of the new iPhone 4 at WWDC,
  Apple announced the release of Safari 5 for Windows and Mac......
&lt;/<span style="color: #cae682;">article</span>&gt;
</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> &lt;header&gt; 标签</h2>
<div class="outline-text-2" id="text-4">

<p><b>定义和用法</b>
&lt;header&gt;标签定义文档的页眉（介绍信息）。
<b>实例</b>
对主页的介绍：
</p>


<pre class="src src-html">&lt;<span style="color: #cae682;">header</span>&gt;
  &lt;<span style="color: #cae682;">h1</span>&gt;<span style="font-weight: bold; text-decoration: underline;">Welcome to my homepage</span>&lt;/<span style="color: #cae682;">h1</span>&gt;
  &lt;<span style="color: #cae682;">p</span>&gt;My name is Donald Duck&lt;/<span style="color: #cae682;">p</span>&gt;
&lt;/<span style="color: #cae682;">header</span>&gt;

&lt;<span style="color: #cae682;">p</span>&gt;The rest of my home page...&lt;/<span style="color: #cae682;">p</span>&gt;
</pre>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> &lt;footer&gt; 标签</h2>
<div class="outline-text-2" id="text-5">

<p><b>定义和用法</b>
&lt;footer&gt;标签定义 section 或 document 的页脚。
在典型情况下，该元素会包含创作者的姓名、文档的创作日期以及/或者联系信息。
</p>
<p>
<b>实例</b>
</p>
<p>
文档的页脚：
</p>


<pre class="src src-html">&lt;<span style="color: #cae682;">footer</span>&gt;This document was written in 2010&lt;/<span style="color: #cae682;">footer</span>&gt;
</pre>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> &lt;aside&gt; 标签</h2>
<div class="outline-text-2" id="text-6">

<p><b>定义和用法</b>
&lt;aside&gt; 标签定义 article 以外的内容。aside 的内容应该与 article 的内容相关。
</p>
<p>
<b>实例</b>
</p>



<pre class="src src-html">&lt;<span style="color: #cae682;">p</span>&gt;Me and my family visited The Epcot center this summer.&lt;/<span style="color: #cae682;">p</span>&gt;
&lt;<span style="color: #cae682;">aside</span>&gt;
  &lt;<span style="color: #cae682;">h4</span>&gt;<span style="text-decoration: underline;">Epcot Center</span>&lt;/<span style="color: #cae682;">h4</span>&gt;
  The Epcot Center is a theme park in Disney World, Florida.
&lt;/<span style="color: #cae682;">aside</span>&gt;
</pre>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-01 18:03:08 CST</p>
<p class="author">Author: HDC</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
